requestTo2A.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:examples:PostsService" xmlns:pos="http://www.examples.com/wsdl/PostsService.wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetPosts soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <pos:PostsPage>
            <iPage xsi:type="xsd:int">1</iPage>
         </pos:PostsPage>
      </urn:GetPosts>
   </soapenv:Body>
</soapenv:Envelope>